pkg/wsman/wsmantesting/responses/amt/ethernetport/put.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/amt-schema/1/AMT_EthernetPortSettings"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>5</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/PutResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-00000000269F</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/amt-schema/1/AMT_EthernetPortSettings</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:AMT_EthernetPortSettings>
            <g:DHCPEnabled>true</g:DHCPEnabled>
            <g:DefaultGateway>192.168.0.1</g:DefaultGateway>
            <g:ElementName>Intel(r) AMT Ethernet Port Settings</g:ElementName>
            <g:IPAddress>192.168.0.24</g:IPAddress>
            <g:InstanceID>Intel(r) AMT Ethernet Port Settings 0</g:InstanceID>
            <g:IpSyncEnabled>true</g:IpSyncEnabled>
            <g:LinkIsUp>true</g:LinkIsUp>
            <g:LinkPolicy>1</g:LinkPolicy>
            <g:LinkPolicy>14</g:LinkPolicy>
            <g:LinkPolicy>16</g:LinkPolicy>
            <g:MACAddress>a4-ae-11-1e-46-53</g:MACAddress>
            <g:PhysicalConnectionType>0</g:PhysicalConnectionType>
            <g:PrimaryDNS>68.105.28.11</g:PrimaryDNS>
            <g:SecondaryDNS>68.105.29.11</g:SecondaryDNS>
            <g:SharedDynamicIP>true</g:SharedDynamicIP>
            <g:SharedMAC>true</g:SharedMAC>
            <g:SharedStaticIp>true</g:SharedStaticIp>
            <g:SubnetMask>255.255.255.0</g:SubnetMask>
        </g:AMT_EthernetPortSettings>
    </a:Body>
</a:Envelope>